import Alpine from 'alpinejs';

import { createIcons, icons } from 'lucide';



/*
|--------------------------------------------------------------------------
| Alpine.js
|--------------------------------------------------------------------------
|
| فعال‌سازی Alpine برای منوها، تعاملات و کامپوننت‌های پویا
|
|--------------------------------------------------------------------------
*/


window.Alpine = Alpine;

Alpine.start();





/*
|--------------------------------------------------------------------------
| Lucide Icons
|--------------------------------------------------------------------------
|
| فعال‌سازی آیکون‌های Lucide
|
|--------------------------------------------------------------------------
*/


document.addEventListener('DOMContentLoaded', () => {


    createIcons({

        icons

    });


});