<?php

namespace App\Blocks;


/*
|--------------------------------------------------------------------------
| Block Schema Resolver
|--------------------------------------------------------------------------
|
| این کلاس وظیفه دارد Schema مربوط به هر Block
| را بر اساس type انتخاب شده برگرداند.
|
| مثال:
|
| hero
|   ↓
| HeroBlock::schema()
|
| cards
|   ↓
| CardsBlock::schema()
|
|--------------------------------------------------------------------------
*/


class BlockSchema
{


    /*
    |--------------------------------------------------------------------------
    | Get Schema
    |--------------------------------------------------------------------------
    |
    | دریافت نوع Block و برگرداندن فرم مربوطه
    |
    |--------------------------------------------------------------------------
    */


    public static function make(?string $type): array
    {


        if (!$type) {

            return [];

        }



        return BlockRegistry::getSchema($type);


    }


}